app/controllers/productos_controller.rb

  def show
    @producto = Producto.find(params[:id])
---
SELECT * FROM "productos" WHERE ("productos"."id" = 1)

  def edit
    @producto = Producto.find(params[:id])
---
SELECT * FROM "productos" WHERE ("productos"."id" = 1)

  def create
    @producto = Producto.new(params[:producto])

    respond_to do |format|
      if @producto.save
---
INSERT INTO "productos" ("name", "empresa", "ahno", "created_at", "updated_at", "precio", "modelo") VALUES('HG3029', 'Choloville', '2009-05-22', '2010-01-22 04:14:56', '2010-01-22 04:14:56', 4000.0, 'CV3440')

  def update
    @producto = Producto.find(params[:id])
---
SELECT * FROM "productos" WHERE ("productos"."id" = 1)